app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    if @project.save
---
INSERT INTO "projects" ("title", "start_date", "end_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Title Project"], ["start_date", 2017-01-21 03:15:40 UTC], ["end_date", 2017-01-28 03:15:40 UTC], ["created_at", 2017-01-21 03:15:40 UTC], ["updated_at", 2017-01-21 03:15:40 UTC]]

  def update
    if @project.update(project_params)
---
UPDATE "projects" SET "title" = ?, "start_date" = ?, "end_date" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["title", "New Title"], ["start_date", 2017-02-04 16:38:45 UTC], ["end_date", 2017-02-11 16:38:45 UTC], ["updated_at", 2017-01-21 16:38:45 UTC], ["id", 155]]